lab11_ci/ci4/app/Controllers/Page.php

SELECT *
FROM `artikel`
WHERE `status` = 1
ORDER BY `created_at` DESC
SELECT *
FROM `halaman`
WHERE `nama` = 'home'
---
    public function index()
    {
        $db = \Config\Database::connect();

        $artikel = $db->table('artikel')
                      ->where('status', 1)
                      ->orderBy('created_at', 'DESC')
                      ->get()
                      ->getResult();

        $home = $db->table('halaman')
                   ->where('nama', 'home')
                   ->get()
                   ->getRow();

SELECT *
FROM `kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id` = `artikel`.`kategori_id`
WHERE `status` = 1
ORDER BY `created_at` DESC
---
    public function artikel()
{
    $db = \Config\Database::connect();

    $q = $this->request->getGet('q');
    $kategori = $this->request->getGet('kategori');

    $kategoriData = $db->table('kategori')->get()->getResult();

    $builder = $db->table('artikel')
                  ->select('artikel.*, kategori.nama_kategori')
                  ->join('kategori', 'kategori.id = artikel.kategori_id')
                  ->where('status', 1);

    if($q){
        $builder->like('judul', $q);
    }

    if($kategori){
        $builder->where('kategori.id', $kategori);
    }

    $artikel = $builder
                ->orderBy('created_at', 'DESC')
                ->get()
                ->getResult();

SELECT *
FROM `halaman`
WHERE `nama` = 'about'
---
    public function about()
    {
        $db = \Config\Database::connect();

        $about = $db->table('halaman')
                    ->where('nama', 'about')
                    ->get()
                    ->getRow();

SELECT *
FROM `halaman`
WHERE `nama` = 'contact'
---
    public function contact()
    {
        $db = \Config\Database::connect();

        $contact = $db->table('halaman')
                      ->where('nama', 'contact')
                      ->get()
                      ->getRow();